Revit 2020 API
UnitGroup Enumeration
 A group of related unit types, primarily classified by discipline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Since: 2014
Syntax
C#
public enum UnitGroup
Visual Basic
Public Enumeration UnitGroup
Visual C++
public enum class UnitGroup
Members
Member name | Description
Common |  Common
Structural |  Structural
HVAC |  HVAC
Electrical |  Electrical
Piping |  Piping
Energy |  Energy
See Also
Autodesk.Revit.DB Namespace